<?php

/**
 * ************************************************************************
 *
 * ショートコード
 *
 * 作成したショートコード
 *
 * ************************************************************************
 */

/**
 * 何も返さない（コメントアウト代わり）
 * ************************************************************************
 * @see https://www.u-1.net/2009/11/07/1963/
 *
 * @param string null
 * @return string null
 *
 * [ignore][/ignore]で囲む
 */
function ignore_shortcode($atts, $content = null)
{
  return null;
}
add_shortcode('ignore', 'ignore_shortcode');
